app/Controllers/login_controller.php

SELECT *
FROM `usuarios`
WHERE `email` = 'cura@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $model = new UsuarioModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $usuario = $model->where('email', $email)->first();