app/Controllers/Usuario_controller.php

    public function index()
    {
        // Solo si hay sesión iniciada
        if (!session()->has('usuario')) {
            return redirect()->to('/login');
        }

        $model = new UsuarioModel();
        $data['usuarios'] = $model->findAll();
---
SELECT *
FROM `usuarios`